// src/components/AboutProjectModal.tsx
import React from "react";
import Modal from "./Modal";

interface AboutProjectModalProps {
	isOpen: boolean;
	onClose: () => void;
}

const AboutProjectModal: React.FC<AboutProjectModalProps> = ({ isOpen, onClose }) => {
	return (
		<Modal isOpen={isOpen} onClose={onClose} title="Аб праекце">
			<div className="text-left space-y-4 text-gray-700"> 
				<p> <strong>Сэнсавы турызм - падарожжы па звычайных месцах, але незвычайныя па сэнсе.</strong> <br /> Ты вандруеш па Беларусі, агортваючыся падзеямі, творамі, думкамі, сэнсамі. <br /> Ты становішся суўдзельнікам, пазнаеш геніяў свайго месца, перажываеш гісторыю, як частку свайго жыцця, а гэта зусім іншая справа. <br /> Мы стараемся выявіць прыгажосць і сілу нашых месцаў і нашых геніяў з усіх бакоў. </p> <p> <strong>Геній майго месца ГММ - нацыянальны праект сэнсавага турызму.</strong> <br /> Сотні падарожжаў па ўсёй Беларусі. Кожны куток слаўны сваім геніем - чалавекам, які адмеціў і змяніў сваё месца. Часам мы забываем пра сваіх геніяў, але трэба іх помніць, бо яны наш падмурак. Кожны з нас стане мацнейшым, калі возьме ўзор са свайго генія. </p> <p> <strong>ГММ-падарожжы - для самастойных, неабыякавых і актыўных людзей. </strong> <br /> Вандруйце самі на аўто, ровары, пешшу. Сям&apos;ёю, з сябрамі, аматарамі, калектывам. <br /> Кожны тур дае мапу, даведнік, аўдыёгід, літаратурныя і медыйныя дадаткі. Можна вандраваць на канапе, гледзячы, чытаючы або слухаючы вобразы і тэксты. </p> <p> <strong>Кожны зможа знайсці падарожжа па душы.</strong> <br /> Камусьці важна, каб падарожжа было пазнавальным, некаму эстэтыка і прыгажосць мясцовай архітэктуры і прыроды... У кожнага ГГМ-падарожжы ёсць рэйтынг, які дапаможа знайсці менавіта тое падарожжа, якое прынясе Вам шмат дадатных эмоцый. 
				</p> 
				</div>
		</Modal>
	);
};

export default AboutProjectModal;
