import React from "react";

const SupportInstructions: React.FC = () => {
	return (
		<section className="text-gray-700 space-y-6 leading-relaxed">
			<p className='text-center'>
				Увесь кантэнт падарожжа мы прапануем бясплатна. Ад Вас патрабуецца толькі
				ўглыбіцца ў сэнс гэтага падарожжа і атрымаць эмоцыі. Паспрабуйце, Вам
				спадабаецца!
			</p>
			<p className='font-bold text-center'>
				Але мы будзем вельмі ўдзячныя, калі ў Вас ёсць магчымасць ці жаданне
				падтрымаць праект, каб ён развіваўся далей, бо пошук інфармацыі для
				падарожжаў, распрацоўка і адладка маршрутаў, стварэнне аўдыягіда,
				даведніка і многа многа іншага займае вельмі шмат часу. Усё гэта мы
				робім на самаахвотных пачатках.
			</p>
		</section>
	);
};

export default SupportInstructions;
